Jamison Hunter

June 30, 2023

# Sakila Queries

![png](sakila-db-model.png)

Create a new repository and notebook for this assignment.

Using the Sakila database, complete the below queries with Python in your Jupyter Notebook.
* You can use MySQL Workbench to test your queries and then copy and paste them into your notebook to perform with Pandas and SQLAlchemy.

In [1]:
# Imports
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

In [5]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root" 
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [6]:
# creating engine
engine = create_engine(connection)

In [21]:
# checking if everything is properly connected and queries are functional
q = """SELECT * FROM actor;"""
pd.read_sql(q, engine).head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-14 12:34:33
1         2       NICK      WAHLBERG 2006-02-14 12:34:33
2         3         ED         CHASE 2006-02-14 12:34:33
3         4   JENNIFER         DAVIS 2006-02-14 12:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-14 12:34:33

What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [28]:
# finding which city is represented by city_id = 312
q = """SELECT * FROM city where city_id=312;"""
pd.read_sql(q, engine).head()

   city_id    city  country_id         last_update
0      312  London         102 2006-02-14 12:45:25

In [43]:
# joining address and city in order to find address_id within London
q = """SELECT *
FROM address
JOIN city
ON city.city_id = address.city_id
WHERE address.city_id = 312;"""
pd.read_sql(q, engine).head()

,address_id,address,address2,district,city_id,postal_code,phone,last_update,city_id,city,country_id,last_update
0,256,1497 Yuzhou Drive,,England,312,3433,246810237916,2006-02-14 12:45:30,312,London,102,2006-02-14 12:45:25
1,517,548 Uruapan Street,,Ontario,312,35653,879347453467,2006-02-14 12:45:30,312,London,102,2006-02-14 12:45:25

In [46]:
# customer from London with address_id 256
q = """SELECT *
FROM address
JOIN customer
ON customer.address_id = address.address_id
WHERE address.address_id = 256;"""
pd.read_sql(q, engine).head()

,address_id,address,address2,district,city_id,postal_code,phone,last_update,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,256,1497 Yuzhou Drive,,England,312,3433,246810237916,2006-02-14 12:45:30,252,2,MATTIE,HOFFMAN,MATTIE.HOFFMAN@sakilacustomer.org,256,1,2006-02-14 22:04:36,2006-02-14 12:57:20

In [47]:
# customer from London with address_id 517
q = """SELECT *
FROM address
JOIN customer
ON customer.address_id = address.address_id
WHERE address.address_id = 517;"""
pd.read_sql(q, engine).head()

,address_id,address,address2,district,city_id,postal_code,phone,last_update,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,517,548 Uruapan Street,,Ontario,312,35653,879347453467,2006-02-14 12:45:30,512,1,CECIL,VINES,CECIL.VINES@sakilacustomer.org,517,1,2006-02-14 22:04:37,2006-02-14 12:57:20

What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [54]:
# accessing all comedy films by joining film_category with category
q = """SELECT *
FROM film_category
JOIN category
ON category.category_id = film_category.category_id
WHERE category.name = 'Comedy';"""
pd.read_sql(q, engine).info()
pd.read_sql(q, engine).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   film_id      58 non-null     int64
 1   category_id  58 non-null     int64
 2   last_update  58 non-null     datetime64[ns]
 3   category_id  58 non-null     int64
 4   name         58 non-null     object
 5   last_update  58 non-null     datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(1)
memory usage: 2.8+ KB

,film_id,category_id,last_update,category_id,name,last_update
0,7,5,2006-02-14 13:07:09,5,Comedy,2006-02-14 12:46:27
1,28,5,2006-02-14 13:07:09,5,Comedy,2006-02-14 12:46:27
2,99,5,2006-02-14 13:07:09,5,Comedy,2006-02-14 12:46:27
3,119,5,2006-02-14 13:07:09,5,Comedy,2006-02-14 12:46:27
4,127,5,2006-02-14 13:07:09,5,Comedy,2006-02-14 12:46:27

We now know that the category_id for Comedy is 5.

In [56]:
# comedu films have been selected for using category_id = 5
q = """SELECT *
FROM film_category
JOIN film
ON film.film_id = film_category.film_id
WHERE film_category.category_id = 5;"""
pd.read_sql(q, engine).info()
pd.read_sql(q, engine).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 16 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               58 non-null     int64
 1   category_id           58 non-null     int64
 2   last_update           58 non-null     datetime64[ns]
 3   film_id               58 non-null     int64
 4   title                 58 non-null     object
 5   description           58 non-null     object
 6   release_year          58 non-null     int64
 7   language_id           58 non-null     int64
 8   original_language_id  0 non-null      object
 9   rental_duration       58 non-null     int64
 10  rental_rate           58 non-null     float64
 11  length                58 non-null     int64
 12  replacement_cost      58 non-null     float64
 13  rating                58 non-null     object
 14  special_features      58 non-null     object
 15  last_update           58 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(7), object(5)
memory usage: 7.4+ KB

,film_id,category_id,last_update,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,7,5,2006-02-14 13:07:09,7,AIRPLANE SIERRA,A Touching Saga of a Hunter And a Butler who m...,2006,1,None,6,4.99,62,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-14 13:03:42
1,28,5,2006-02-14 13:07:09,28,ANTHEM LUKE,A Touching Panorama of a Waitress And a Woman ...,2006,1,None,5,4.99,91,16.99,PG-13,"Deleted Scenes,Behind the Scenes",2006-02-14 13:03:42
2,99,5,2006-02-14 13:07:09,99,BRINGING HYSTERICAL,A Fateful Saga of a A Shark And a Technical Wr...,2006,1,None,7,2.99,136,14.99,PG,Trailers,2006-02-14 13:03:42
3,119,5,2006-02-14 13:07:09,119,CAPER MOTIONS,A Fateful Saga of a Moose And a Car who must P...,2006,1,None,6,0.99,176,22.99,G,"Trailers,Commentaries,Deleted Scenes",2006-02-14 13:03:42
4,127,5,2006-02-14 13:07:09,127,CAT CONEHEADS,A Fast-Paced Panorama of a Girl And a A Shark ...,2006,1,None,5,4.99,112,14.99,G,"Commentaries,Deleted Scenes",2006-02-14 13:03:42

What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [64]:
# finding Johnny Lollobrigida's film IDs
q = """SELECT *
FROM actor
JOIN film_actor
ON film_actor.actor_id = actor.actor_id
WHERE actor.last_name = "Lollobrigida";"""
pd.read_sql(q, engine).info()
pd.read_sql(q, engine).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     29 non-null     int64
 1   first_name   29 non-null     object
 2   last_name    29 non-null     object
 3   last_update  29 non-null     datetime64[ns]
 4   actor_id     29 non-null     int64
 5   film_id      29 non-null     int64
 6   last_update  29 non-null     datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(2)
memory usage: 1.7+ KB

,actor_id,first_name,last_name,last_update,actor_id,film_id,last_update
0,5,JOHNNY,LOLLOBRIGIDA,2006-02-14 12:34:33,5,19,2006-02-14 13:05:03
1,5,JOHNNY,LOLLOBRIGIDA,2006-02-14 12:34:33,5,54,2006-02-14 13:05:03
2,5,JOHNNY,LOLLOBRIGIDA,2006-02-14 12:34:33,5,85,2006-02-14 13:05:03
3,5,JOHNNY,LOLLOBRIGIDA,2006-02-14 12:34:33,5,146,2006-02-14 13:05:03
4,5,JOHNNY,LOLLOBRIGIDA,2006-02-14 12:34:33,5,171,2006-02-14 13:05:03

In [68]:
# listing all films with actor_id = 5
q = """SELECT *
FROM film
JOIN film_actor
ON film_actor.film_id = film.film_id
WHERE film_actor.actor_id = 5;"""
pd.read_sql(q, engine).info()
pd.read_sql(q, engine).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 16 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               29 non-null     int64
 1   title                 29 non-null     object
 2   description           29 non-null     object
 3   release_year          29 non-null     int64
 4   language_id           29 non-null     int64
 5   original_language_id  0 non-null      object
 6   rental_duration       29 non-null     int64
 7   rental_rate           29 non-null     float64
 8   length                29 non-null     int64
 9   replacement_cost      29 non-null     float64
 10  rating                29 non-null     object
 11  special_features      29 non-null     object
 12  last_update           29 non-null     datetime64[ns]
 13  actor_id              29 non-null     int64
 14  film_id               29 non-null     int64
 15  last_update           29 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(7), object(5)
memory usage: 3.8+ KB

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update,actor_id,film_id,last_update
0,19,AMADEUS HOLY,A Emotional Display of a Pioneer And a Technic...,2006,1,None,6,0.99,113,20.99,PG,"Commentaries,Deleted Scenes,Behind the Scenes",2006-02-14 13:03:42,5,19,2006-02-14 13:05:03
1,54,BANGER PINOCCHIO,A Awe-Inspiring Drama of a Car And a Pastry Ch...,2006,1,None,5,0.99,113,15.99,R,"Trailers,Commentaries,Deleted Scenes",2006-02-14 13:03:42,5,54,2006-02-14 13:05:03
2,85,BONNIE HOLOCAUST,A Fast-Paced Story of a Crocodile And a Robot ...,2006,1,None,4,0.99,63,29.99,G,Deleted Scenes,2006-02-14 13:03:42,5,85,2006-02-14 13:05:03
3,146,CHITTY LOCK,A Boring Epistle of a Boat And a Database Admi...,2006,1,None,6,2.99,107,24.99,G,Commentaries,2006-02-14 13:03:42,5,146,2006-02-14 13:05:03
4,171,COMMANDMENTS EXPRESS,A Fanciful Saga of a Student And a Mad Scienti...,2006,1,None,6,4.99,59,13.99,R,"Trailers,Commentaries,Deleted Scenes",2006-02-14 13:03:42,5,171,2006-02-14 13:05:03

What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [73]:
q = """SELECT *
FROM film
JOIN film_actor
ON film_actor.film_id = film.film_id
WHERE film.title = "Bingo Talented";"""
pd.read_sql(q, engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update,actor_id,film_id,last_update
0,73,BINGO TALENTED,A Touching Tale of a Girl And a Crocodile who ...,2006,1,None,5,2.99,150,22.99,PG-13,"Trailers,Commentaries",2006-02-14 13:03:42,39,73,2006-02-14 13:05:03
1,73,BINGO TALENTED,A Touching Tale of a Girl And a Crocodile who ...,2006,1,None,5,2.99,150,22.99,PG-13,"Trailers,Commentaries",2006-02-14 13:03:42,63,73,2006-02-14 13:05:03
2,73,BINGO TALENTED,A Touching Tale of a Girl And a Crocodile who ...,2006,1,None,5,2.99,150,22.99,PG-13,"Trailers,Commentaries",2006-02-14 13:03:42,77,73,2006-02-14 13:05:03
3,73,BINGO TALENTED,A Touching Tale of a Girl And a Crocodile who ...,2006,1,None,5,2.99,150,22.99,PG-13,"Trailers,Commentaries",2006-02-14 13:03:42,176,73,2006-02-14 13:05:03
4,73,BINGO TALENTED,A Touching Tale of a Girl And a Crocodile who ...,2006,1,None,5,2.99,150,22.99,PG-13,"Trailers,Commentaries",2006-02-14 13:03:42,187,73,2006-02-14 13:05:03

In [74]:
# displaying actors based on film_id = 73
q = """SELECT *
FROM actor
JOIN film_actor
ON film_actor.actor_id = actor.actor_id
WHERE film_actor.film_id = 73;"""
pd.read_sql(q, engine)

,actor_id,first_name,last_name,last_update,actor_id,film_id,last_update
0,39,GOLDIE,BRODY,2006-02-14 12:34:33,39,73,2006-02-14 13:05:03
1,63,CAMERON,WRAY,2006-02-14 12:34:33,63,73,2006-02-14 13:05:03
2,77,CARY,MCCONAUGHEY,2006-02-14 12:34:33,77,73,2006-02-14 13:05:03
3,176,JON,CHASE,2006-02-14 12:34:33,176,73,2006-02-14 13:05:03
4,187,RENEE,BALL,2006-02-14 12:34:33,187,73,2006-02-14 13:05:03

What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [90]:
# finding the average payment amount
q = """SELECT 2*AVG(amount) FROM payment;"""
pd.read_sql(q, engine).head()

   2*AVG(amount)
0       8.401335

In [92]:
# selecting for rows with greater than twice the average payment amount
q = """SELECT *
From payment
WHERE amount > 8.401335"""
pd.read_sql(q, engine).info()
pd.read_sql(q, engine).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 857 entries, 0 to 856
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   payment_id    857 non-null    int64
 1   customer_id   857 non-null    int64
 2   staff_id      857 non-null    int64
 3   rental_id     857 non-null    int64
 4   amount        857 non-null    float64
 5   payment_date  857 non-null    datetime64[ns]
 6   last_update   857 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(4)
memory usage: 47.0 KB

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,5,1,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 06:12:30
1,44,2,2,9236,10.99,2005-07-30 13:47:43,2006-02-15 06:12:30
2,62,3,1,1546,8.99,2005-06-16 01:34:05,2006-02-15 06:12:30
3,69,3,2,7503,10.99,2005-07-27 20:23:12,2006-02-15 06:12:30
4,81,3,1,13403,8.99,2005-08-19 22:18:07,2006-02-15 06:12:30

What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [103]:
q = """SELECT * FROM payment ORDER BY amount DESC LIMIT 5;"""
pd.read_sql(q, engine)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,5281,196,2,106,11.99,2005-05-25 18:18:19,2006-02-15 06:14:00
1,5280,195,2,16040,11.99,2005-08-23 22:19:33,2006-02-15 06:14:00
2,3146,116,2,14763,11.99,2005-08-21 23:34:00,2006-02-15 06:13:08
3,342,13,2,8831,11.99,2005-07-29 22:37:41,2006-02-15 06:12:31
4,5550,204,2,15415,11.99,2005-08-22 23:48:56,2006-02-15 06:14:07

In [120]:
q1 = """SELECT * FROM customer WHERE customer_id = 196"""
q2 = """SELECT * FROM customer WHERE customer_id = 195"""
q3 = """SELECT * FROM customer WHERE customer_id = 116"""
q4 = """SELECT * FROM customer WHERE customer_id = 13"""
q5 = """SELECT * FROM customer WHERE customer_id = 204"""
df1 = pd.read_sql(q1, engine)
df2 = pd.read_sql(q2, engine)
df3 = pd.read_sql(q3, engine)
df4 = pd.read_sql(q4, engine)
df5 = pd.read_sql(q5, engine)
df1 = df1.append(df2)
df1 = df1.append(df3)
df1 = df1.append(df4)
df1 = df1.append(df5)
df1

C:\Users\Jamison\AppData\Local\Temp\ipykernel_6576\3502304034.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df1.append(df2)
C:\Users\Jamison\AppData\Local\Temp\ipykernel_6576\3502304034.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df1.append(df3)
C:\Users\Jamison\AppData\Local\Temp\ipykernel_6576\3502304034.py:13: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df1.append(df4)
C:\Users\Jamison\AppData\Local\Temp\ipykernel_6576\3502304034.py:14: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df1.append(df5)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,196,1,ALMA,AUSTIN,ALMA.AUSTIN@sakilacustomer.org,200,1,2006-02-14 22:04:36,2006-02-14 12:57:20
0,195,1,VANESSA,SIMS,VANESSA.SIMS@sakilacustomer.org,199,1,2006-02-14 22:04:36,2006-02-14 12:57:20
0,116,1,VICTORIA,GIBSON,VICTORIA.GIBSON@sakilacustomer.org,120,1,2006-02-14 22:04:36,2006-02-14 12:57:20
0,13,2,KAREN,JACKSON,KAREN.JACKSON@sakilacustomer.org,17,1,2006-02-14 22:04:36,2006-02-14 12:57:20
0,204,1,ROSEMARY,SCHMIDT,ROSEMARY.SCHMIDT@sakilacustomer.org,208,1,2006-02-14 22:04:36,2006-02-14 12:57:20